<a href="https://colab.research.google.com/github/ucr-courses/lab-session-1/blob/main/Knn.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
# prompt: simulate a 100 row dataset with two variables price and year

df <- data.frame(
  price = rnorm(100, mean = 100, sd = 15),
  year = sample(2000:2023, 100, replace = TRUE)
)

In [4]:
head(df)

  price     year
1  99.26646 2002
2 104.92971 2022
3 120.85015 2011
4 107.61797 2011
5  86.84749 2005
6 129.05281 2007